#include "bsp_crc.h"
#include "crc.h"

//---------------------------------------------------------------------------
// Definitions
//---------------------------------------------------------------------------

#define LOG_LOCAL_TAG   "bsp_crc"
#define LOG_LOCAL_LEVEL LOG_LEVEL_INFO

//---------------------------------------------------------------------------
// Prototypes
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
// Variables
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
// Functions
//---------------------------------------------------------------------------

u16 Crc16_ModbusRtu(u8* pu8Data, u16 u16Len)
{
    // HAL_CRC_Accumulate: 在上次计算结果之上，再继续计算 CRC（不清除 DR 寄存器，即分块计算）
    // HAL_CRC_Calculate:  仅计算本次输入的数据 CRC（会清除 DR 寄存器，即整块计算）

    // hcrc.InputDataFormat = CRC_INPUTDATA_FORMAT_BYTES;
    return HAL_CRC_Calculate(&hcrc, (uint32_t*)pu8Data, u16Len);
}
